In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [11]:
string_data[0]= 1

In [12]:
string_data

0            1
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data.fillna

<bound method Series.fillna of 0            1
1    artichoke
2          NaN
3      avocado
dtype: object>

In [14]:
from numpy import nan as NA

In [15]:
data = pd.Series([1,NA,3.5,NA,7])

In [20]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])

In [30]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [37]:
cleaned = data.dropna(how='all')

In [38]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [39]:
data[1] = NA

In [40]:
data

     0   1    2
0  1.0 NaN  3.0
1  1.0 NaN  NaN
2  NaN NaN  NaN
3  NaN NaN  3.0

In [41]:
data.dropna(axis=1,how='all')

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [44]:
data2 = pd.DataFrame(np.random.randn(7,3))

In [48]:
data2.iloc[:4,1] =NA

In [50]:
data2.iloc[:2,2] = NA

In [51]:
data2

          0         1         2
0 -1.774086       NaN       NaN
1  0.967713       NaN       NaN
2 -0.778559       NaN  1.232735
3 -0.340781       NaN  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [52]:
data2.dropna()

          0         1         2
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [53]:
data2.dropna(thresh=2)

          0         1         2
2 -0.778559       NaN  1.232735
3 -0.340781       NaN  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [55]:
data2.fillna(0)

          0         1         2
0 -1.774086  0.000000  0.000000
1  0.967713  0.000000  0.000000
2 -0.778559  0.000000  1.232735
3 -0.340781  0.000000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [56]:
data2.fillna({1:0.5,2:0})

          0         1         2
0 -1.774086  0.500000  0.000000
1  0.967713  0.500000  0.000000
2 -0.778559  0.500000  1.232735
3 -0.340781  0.500000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [57]:
_ = data2.fillna(0, inplace = True)

In [58]:
data2

          0         1         2
0 -1.774086  0.000000  0.000000
1  0.967713  0.000000  0.000000
2 -0.778559  0.000000  1.232735
3 -0.340781  0.000000  0.992676
4 -0.835914 -0.836357 -0.740297
5  0.665659 -1.515476  0.278934
6  1.603884  0.535949 -0.025552

In [61]:
data = pd.DataFrame({'k1': ['one','two'] *3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [65]:
data['v1'] = range(7)

In [67]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [68]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [69]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [80]:
data = pd.DataFrame({"food": ['bacon', 'pulled pork','bacon','Pastrami',
                             'corned beef','Bacon','pastrami','honey ham','nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [81]:
meat_type = {'bacon':'pig',
            'pulled pork': 'pig',
            'pastrami': 'cow',
            'corned beef' : 'cow',
            "honey ham": "pig",
            'nova lox': 'salmon'}

In [82]:
lowercased = data['food'].str.lower()

In [83]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [89]:
data['animal'] = lowercased.map(meat_type)

In [99]:
data.drop(data.columns [[3]], axis = 1)

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [100]:
data['food'].map(lambda x: meat_type[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [104]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [102]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [106]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [110]:
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [111]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [112]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [113]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [120]:
transform = lambda x: x[:4].upper()

In [121]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')